In [1]:
import pandas as pd

In [3]:
###dataframe dictonary using list
df=pd.DataFrame({'student_id':[101,102,103],'student_name':['vinay','ravi','vijay']})
df

   student_id student_name
0         101        vinay
1         102         ravi
2         103        vijay

In [4]:
###dataframe dictonary using tuple
df1=pd.DataFrame({'country':('india','usa'),'city':('mumbai','new york')})
df1

  country      city
0   india    mumbai
1     usa  new york

In [8]:
###dataframe dictonary using dictonary
df3=pd.DataFrame({'course':{'Data Science':'6 month'},'student':{'ram':'bangalore'}})
df3

               course    student
Data Science  6 month        NaN
ram               NaN  bangalore

In [15]:
dq1={'student_id':[101,102,103,104],'student_name':['vinay','ravi','vijay']}
t=pd.Series(dq1)

In [16]:
t

student_id      [101, 102, 103, 104]
student_name    [vinay, ravi, vijay]
dtype: object

In [18]:
dq2={'student_id':[101,102,103,104],'student_name':['vinay','ravi','vijay','kk','ll']}
t1=pd.Series(dq2)
t1

student_id              [101, 102, 103, 104]
student_name    [vinay, ravi, vijay, kk, ll]
dtype: object

In [19]:
#create dictionary and pass variable in dataframe using list
dict1={'student_id':[101,102,103],'student_name':['vinay','ravi','vijay']}
dict1

{'student_id': [101, 102, 103], 'student_name': ['vinay', 'ravi', 'vijay']}

In [20]:
f=pd.DataFrame(dict1)
f

   student_id student_name
0         101        vinay
1         102         ravi
2         103        vijay

In [21]:
#create dictionary and pass variable in dataframe using tuple
dict2={'country':('india','usa'),'city':('mumbai','new york')}
dict2

{'country': ('india', 'usa'), 'city': ('mumbai', 'new york')}

In [22]:
f1=pd.DataFrame(dict2)
f1

  country      city
0   india    mumbai
1     usa  new york

In [23]:
#create dictionary and pass variable in dataframe using set
dict3={'course':{'Data Science','Data Engineer'},'Duration':{'6 month','3 month'}}
dict3

{'course': {'Data Engineer', 'Data Science'},
 'Duration': {'3 month', '6 month'}}

In [25]:
#create dictionary and pass variable in dataframe using dictonary
dict4={'course':{'Data Science':'6 month'},'student':{'ram':'bangalore'}}
dict4

{'course': {'Data Science': '6 month'}, 'student': {'ram': 'bangalore'}}

In [26]:
f4=pd.DataFrame(dict4)
f4

               course    student
Data Science  6 month        NaN
ram               NaN  bangalore

In [35]:
###dataframe dictonary using single dictonary
new=pd.DataFrame({'name':'ram','age':25},index=[0])
new

  name  age
0  ram   25

In [3]:
#create dictionary and pass variable in dataframe
nn=({'name':'ram','age':25})
nn

{'name': 'ram', 'age': 25}

In [6]:
import pandas as pd
n1=pd.DataFrame(nn,index=[0])
n1

  name  age
0  ram   25

## import csv file

In [7]:
import pandas as pd

In [8]:
country=pd.read_csv('C:/Users/Admin/Documents/Aroha/country.csv')
country

      country    Unnamed: 1
0  country_id  country_name
1         100         INDIA
2         101      SRILANKA
3         102           USA
4         103        CANADA

In [9]:
country1=pd.read_csv('country.csv')
country1

      country    Unnamed: 1
0  country_id  country_name
1         100         INDIA
2         101      SRILANKA
3         102           USA
4         103        CANADA

In [13]:
city=country.to_csv('C:/Users/Admin/Documents/Aroha/city.csv')
city

In [14]:
city1=country.to_csv('city1.csv')
city1

In [21]:
file=pd.read_excel('C:/Users/Admin/Documents/Aroha/File.xlsx')
file

,Have a folder which has some files. Validate the files and move accordingly,Unnamed: 1,Unnamed: 2,Unnamed: 3
0,NaN,NaN,NaN,NaN
1,file1.txt,NaN,NaN,NaN
2,header: today,NaN,NaN,NaN
3,record1,NaN,NaN,NaN
4,record2,NaN,NaN,NaN
5,record3,NaN,NaN,Validate the file based on the header and footer
6,record4,NaN,NaN,The number of records should be equal to no of...
7,footer: = No of Records: 4,NaN,NaN,If there is no header key word or footer keywo...
8,NaN,NaN,NaN,if header and footer exists but the no of reco...
9,file2.txt,NaN,NaN,NaN
10,header: sysdate,NaN,NaN,NaN
11,record1,NaN,NaN,NaN
12,record2,NaN,NaN,NaN
13,record3,NaN,NaN,NaN
14,record4,NaN,NaN,NaN
15,footer = No of Records: 4,NaN,NaN,NaN

In [22]:
file1=pd.read_excel('file.xlsx')
file1

,Have a folder which has some files. Validate the files and move accordingly,Unnamed: 1,Unnamed: 2,Unnamed: 3
0,NaN,NaN,NaN,NaN
1,file1.txt,NaN,NaN,NaN
2,header: today,NaN,NaN,NaN
3,record1,NaN,NaN,NaN
4,record2,NaN,NaN,NaN
5,record3,NaN,NaN,Validate the file based on the header and footer
6,record4,NaN,NaN,The number of records should be equal to no of...
7,footer: = No of Records: 4,NaN,NaN,If there is no header key word or footer keywo...
8,NaN,NaN,NaN,if header and footer exists but the no of reco...
9,file2.txt,NaN,NaN,NaN
10,header: sysdate,NaN,NaN,NaN
11,record1,NaN,NaN,NaN
12,record2,NaN,NaN,NaN
13,record3,NaN,NaN,NaN
14,record4,NaN,NaN,NaN
15,footer = No of Records: 4,NaN,NaN,NaN